Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: དཔའ་བོ་ཐུགས་དག་མི་ཡི་སེང་གེས་བདུད་སྟོབས་རབ་ཏུ་བཅོམ། །
en: “ ‘Hero of pure heart, lion of men, you crush the māras’ power.

source: ཉོན་མོངས་ཚོགས་བཅོམ་འགྲོ་བ་མཁྱེན་པས་བདེ་འགྲོ་རྗེས་སུ་བརྙེས། །
en: Conqueror of the afflictions, as you know beings, you have obtained the higher realms.

source: སྲོག་ཆགས་ཀུན་སྨན་ཐབས་ཆེན་ཀུན་གྲུབ་དགེ་བ་སྡིག་མི་མངའ། །
en: You heal all beings, accomplish the great means, and are beyond virtue and evil.

source: སྟོབས་བཅུས་སྲེད་པའི་ཆུ་བོ་རྣམས་བསྐམས་སྲིད་པའི་རྒྱ་མཚོ་རྒལ། །
en: Your ten powers dried up the rivers of craving and you crossed the ocean of existence.

source: མི་དབང་མི་ཡི་སེང་གེས་སྲིད་མཚོ་བསྐམས་ཏེ་སྐམ་ལ་ཞུགས། །
en: “ ‘Lord of humans, lion of men, you dried up the ocean of existence and arrived at dry land.

source: སྲིད་མཚོར་ཞུགས་པའི་སེམས་ཅན་ཤིན་ཏུ་ཉམ་ཐག་གཞན་ཡང་སྒྲོལ། །
en: Thus, now you liberate the pitiful beings who are lost in the sea of existence.

source: མི་ཡི་སེང་གེས་མེ་གསུམ་གདུངས་པའི་སྐྱེ་བོ་དེ་ལས་ཐར་མཛད་ཅིང་། །
en: Lion of men, you let beings tormented by the three fires gain release from their pain.

source: རང་བྱུང་རང་བྱུང་ཉིད་ཀྱིས་ཐུགས་ཆུད་འཇིག་རྟེན་ལམ་སྟོན་མཛད། །
en: Self-arisen, thus you realize and show the path to the world.

source: སྟོན་པར་གྱུར་པས་སེམས་ཅན་ལམ་ཉམས་པ་དག་ལམ་ལ་བསླབས། །
en: “ ‘As their teacher, you explain to lost beings the path.

source: དྲང་སྲོང་ཆེན་པོ་ཁྱོད་ལ་བསླབས་ན་བླ་མེད་བྱང་ཆུབ་འཐོབ། །
en: Great sage, by following you we will win unexcelled awakening.

source: ཁྱོད་ཀྱི་སྲས་དག་འཆིང་ལས་རྒལ་ཅིང་སྲིད་པའི་རྒྱ་མཚོ་རྒལ། །
en: Your children leave bondage behind and cross the ocean of existence.

source: སྐམ་ལ་ཕྱིན་ཅིང་མྱ་ངན་འདས་པར་ཞུགས་ཏེ་ཕྱག་འཚལ་བགྱིད། །
en: Reaching dry land, they go beyond suffering—homage to you!

source: འདིར་ནི་འཇིག་རྟེན་མུན་ལམ་རབ་བྱུང་ཆེན་པོ་ཁྱོད་ཀྱིས་བསྟན། །
en: “ ‘Great renunciant, here you show the path for beings in darkness.

source: བདག་ཀྱང་བྱང་ཆུབ་ཐོབ་ནས་ལམ་རབ་ཉམས་པ་ལམ་ལ་བཞག །
en: I, too, shall upon awakening set those who have lost their way upon the path.

source: མགོན་པོ་ཁྱོད་ལ་བསླབས་ན་བླ་མེད་བྱང་ཆུབ་ཞི་བར་མཆི། །
en: Protector, learning from you I shall enter the peace of unsurpassed awakening.

source: བྱང་ཆུབ་ཞི་བ་རྟོགས་ནས་འགྲོ་ཡིད་མ་ཞི་རབ་ཏུ་ཞི་བར་བགྱི། །
en: Realizing the peace of awakening, I shall give peace to the minds of those who lack it.

source: འགྲོ་བ་ལམ་རབ་ཉམས་པ་འདི་དག་འཚལ་ནས་སྙིང་རྗེ་བསྐྱེད། །
en: “ ‘Seeing those on mistaken paths, I feel compassion.

source: སྒྲོན་མ་གསལ་བར་བགྱི་ཞིང་མིག་ལོང་གྱུར་པ་རྣམ་པར་སྦྱང་། །
en: I shall light the lamp brightly, and heal the blind.

source: བདག་གིས་རྒྱལ་བ་བསྟོད་པའི་བསོད་ནམས་མི་ཉུང་འདི་བསྐྱེད་པས། །དགེ་རྩ་དེ་ཡིས་དགྲ་འདུལ་རྒྱལ་བར་བགྱི་ཞིང་འགྲོ་ལམ་བསྟན། །
en: By the not insignificant merit that is gained from thus praising a victorious one, May I tame the enemy, be victorious, and so show the path to wandering beings.’

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་སྒྲ་རྣམ་པར་གྲགས་པ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the brahmin Famous Sound was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་སྒྲ་རྣམ་པར་གྲགས་པ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་ཏོ། །
en: In those days I was the brahmin Famous Sound.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་འདི་ལྟར་བསླབ་པར་བྱ་སྟེ། དེ་བཞིན་གཤེགས་པ་ལ་ཡོན་ཏན་ཡོད་པ་དག་གིས་བསྟོད་པར་བྱ་སྟེ། དེ་ལྟར་བསླབ་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should train by praising the qualities of the thus-gone ones.

source: མཽད་གལ་གྱི་བུ་གཞན་ཡང་ངས་དབང་པོ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the faculties.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། བྲམ་ཟེ་རྒྱལ་གྱི་ལྷ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ལས་བདག་གིར་བྱ་བ་ལ་མངོན་པར་བརྩོན་པ་ཞིག་བྱུང་སྟེ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there was a brahmin known as Victorious God, who was like a great sal tree and endeavored in the appropriation of karma.

source: དེང་བདག་གིས་དགེ་བ་ཅི་ཞིག་མངོན་པར་འདུས་བྱས་མི་དགེ་བ་ཅི་ཞིག་བཏང་། ལུང་དུ་མ་བསྟན་པ་ཅི་ཞིག་མངོན་པར་འདུས་བྱས་སྙམ། དེ་ལས་བདག་གིར་བྱ་བ་ལ་མངོན་པར་བརྩོན་ཏེ། ལས་གང་དང་གང་མངོན་པར་འདུ་བྱ་བ་དེ་ཉིད་ཤིན་ཏུ་ཡོངས་སུ་ཤེས།
en: While doing so, [endeavored in the appropriation of karma] he would think to himself, ‘Which virtues should I produce today, which evils should I abandon, and which neutral states should I produce?’

source: ཡོངས་སུ་རིག །ཤིན་ཏུ་བརྟགས་པས་བྱེད་དེ།
en: He was very knowledgeable, discerning, and aware regarding all actions that he engaged in.

source: གལ་ཏེ་དགེ་བའི་ལས་མངོན་པར་འདུ་བྱེད་ན་ཤིན་ཏུ་བརྟགས་པས་མངོན་པར་འདུ་བྱེད་དོ། །
en: Whenever he brought forth a virtue he would do so with great discernment.

source: དེ་དབང་པོ་གང་གིས་ལས་མངོན་པར་འདུས་བྱས་པའི་དབང་པོ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་ཏེ།
en: He possessed accurate knowledge of the types of faculties that are involved when engaging in an action.

source: གལ་ཏེ་འདོད་ཆགས་ཀྱི་ཕྱོགས་ལས་གང་གིས་འདོད་ཆགས་སྐྱེས་པ་བཟློག་པའི་དབང་པོ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་སོ། །
en: Thus, with respect to desire, he correctly comprehended the faculties that are employed in the overcoming of desire,

source: གལ་ཏེ་ཆུང་ངུའམ། གལ་ཏེ་འབྲིང་ངམ། གལ་ཏེ་ཆེན་པོ་དག་སྟེ།
en: whether of the lesser, medium, or greater types.

source: གལ་ཏེ་དབང་པོ་ཆུང་ངུས་ཉོན་མོངས་པ་ཆུང་ངུ་ཟློག་པར་བྱེད། གལ་ཏེ་དབང་པོ་ཆུང་ངུས་ཉོན་མོངས་པ་འབྲིང་ཟློག་པར་བྱེད། གལ་ཏེ་དབང་པོ་ཆུང་ངུས་ཉོན་མོངས་པ་ཆེན་པོ་ཟློག་པར་བྱེད་དོ། །
en: [He correctly understood] how the lesser faculties are employed to overcome lesser, medium, and greater afflictions;

source: གལ་ཏེ་དབང་པོ་འབྲིང་གིས་ཉོན་མོངས་པ་ཆུང་ངུ་ཟློག་པར་བྱེད། གལ་ཏེ་དབང་པོ་འབྲིང་གིས་ཉོན་མོངས་པ་འབྲིང་ཟློག་པར་བྱེད། གལ་ཏེ་དབང་པོ་འབྲིང་གིས་ཉོན་མོངས་པ་ཆེན་པོ་ཟློག་པར་བྱེད་དོ།
en: how the medium faculties are employed to overcome lesser, medium, and greater afflictions;

source: གལ་ཏེ་དབང་པོ་ཆེན་པོས་ཉོན་མོངས་པ་ཆུང་ངུ་ཟློག་པར་བྱེད། གལ་ཏེ་དབང་པོ་ཆེན་པོས་ཉོན་མོངས་པ་འབྲིང་ཟློག་པར་བྱེད། གལ་ཏེ་དབང་པོ་ཆེན་པོས་ཉོན་མོངས་པ་ཆེན་པོ་ཟློག་པར་བྱེད་པའི་དབང་པོ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་སོ། །
en: and how the greater faculties are employed to overcome lesser, medium, and greater afflictions. He correctly understood

source: དེ་ཤེས་པ་དེ་དང་ལྡན་ཏེ། ལས་དེ་མངོན་པར་འདུས་བྱས་པས་བསྐལ་པ་བརྒྱད་ཅུར་ལོག་པར་ལྟུང་བར་མ་གྱུར་ཏོ། །
en: With such knowledge he would then carry out the relevant actions, and so he avoided all lapses into error for eighty eons.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་རྒྱལ་གྱི་ལྷ་ཞེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the brahmin Victorious God, who was like a great sal tree, was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་རྒྱལ་གྱི་ལྷ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the brahmin Victorious God,

source: དེའི་ཚེ་ཡང་ངས་སེམས་ཅན་རྣམས་ཀྱི་དབང་པོ་ཤེས་པ་ལ་བསླབས་པར་གྱུར་ཏེ།
en: and thus I trained to gain knowledge of the faculties of sentient beings.

source: ད་ལྟར་ཡང་ང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་རྣམས་ཀྱི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Also now, having awoken to unsurpassed and perfect buddhahood, I correctly understand the faculties of sentient beings.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་རྣམས་ཀྱི་དབང་པོ་ཤེས་པ་ལ་བསླབ་པར་བྱའོ། །
en: “Therefore, Maudgalyāyana, bodhisattvas should train to understand the faculties of sentient beings.

source: དབང་པོ་ཤེས་པ་ལ་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕྱིར་མི་ལྡོག་ཅིང་མྱུར་དུ་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་རྗེས་སུ་ཐོབ་བོ།། །།
en: The bodhisattva who trains to comprehend the faculties of sentient beings becomes irreversible and will quickly attain unsurpassed and perfect buddhahood.

source: མཽད་གལ་གྱི་བུ་ངས་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand the origin as related to knowledge of the faculties.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་རྒྱལ་པོ་ཟླ་བའི་ལྷ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: “Maudgalyāyana, once there was a king named Moon God.

source: དེའི་བུ་མོ་ཟླ་བའི་ལྷ་མོ་ཞེས་བྱ་བ་མཁས་ཤིང་ཡིད་གཞུངས་ལ། རྒྱལ་པོའི་བྱ་བ་བྱེད་པ་ཞིག་བྱུང་སྟེ།
en: This king had a learned and intelligent daughter called Goddess of Speech.

source: དེ་ཕ་དེའི་རྒྱལ་སྲིད་རྗེས་སུ་སྐྱོང་ངོ་། །
en: Acting as her father’s regent, she was taking care of his realm.

source: དེ་ནས་རྒྱལ་པོ་ཟླ་བའི་ལྷ་དེས་བུ་མོ་དེ་ལ་སྨྲས་པ།
en: Once, King Moon God asked his daughter,

source: བུ་མོ་རྒྱུ་གང་གིས་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ།
en: ‘My daughter, what are the causes for accomplishing knowledge of the faculties?

source: ཇི་ལྟར་ན་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འཐོབ་པར་འགྱུར་བ་ཁྱོད་ལ་དྲིའོ། །
en: I would like to ask you how one may gain knowledge of the origin as related to knowledge of the faculties.’

source: དེས་དེ་ལ་སྨྲས་པ།
en: “Goddess of Speech replied,

source: དགེ་སྦྱོང་དང་། བྲམ་ཟེ་ཚུལ་ཁྲིམས་དང་ལྡན་ཞིང་ཤིན་ཏུ་མང་དུ་ཐོས་པ་རྣམས་ལ་བསྙེན་བཀུར་བགྱིས་ན་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པར་འགྱུར་ལགས་སོ། །
en: ‘Venerating disciplined and learned mendicants and brahmins brings knowledge of the origin as related to knowledge of the faculties.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: And why?

source: དགེ་སྦྱོང་དང་། བྲམ་ཟེ་ཚུལ་ཁྲིམས་དང་ལྡན་ཞིང་མང་དུ་ཐོས་པ་གང་དེ་དག་ལ་བསྙེན་བཀུར་བགྱིས་ན་ཤེས་པ་དེ་མངོན་པར་འདུ་བགྱིས་པར་འགྱུར་ཞིང་། ཤེས་པ་དེ་ལ་སློབ་པར་འགྱུར་ལགས་ཏེ།
en: Because venerating disciplined and learned mendicants and brahmins causes such knowledge and allows oneself to train in it.

source: རྒྱུ་དེས་ན་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པར་འགྱུར་ལགས་སོ། །
en: Thus, such causal factors will bring the accomplishment of knowledge of the origin as related to knowledge of the faculties.’

source: དེ་ནས་རྒྱལ་པོ་ཟླ་བའི་ལྷས་ལུང་བསྟན་པ་དེ་ཐོས་ནས། སློང་བ་པོ་རྣམས་ལ་མགུ་ཞིང་དགའ་ལ་ཡི་རངས་ཏེ།
en: “Having heard this teaching, King Moon God would regard mendicants with delight and appreciation.

source: རབ་ཏུ་དགའ་ནས་དད་པ་མི་ཕྱེད་པ་ཐོབ་བོ། །
en: With great joy, he attained undivided faith.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན། ཟླ་བའི་ལྷ་ཞེས་བྱ་བའི་བུ་མོར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time King Moon God’s daughter was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཟླ་བའི་ལྷ་ཞེས་བྱ་བའི་བུ་མོར་གྱུར་ཏོ། །
en: In those days I was the daughter of King Moon God, [and in this way I gained knowledge of the origin as related to knowledge of the faculties.]

source: དེའི་ཚེ་ཡང་ང་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་མཁྱེན་པར་གྱུར་ལ།
en: In those days [I was the daughter of King Moon God, and in this way] I gained knowledge of the origin as related to knowledge of the faculties.

source: ད་ལྟར་ཡང་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ། སེམས་ཅན་རྣམས་ལ་ཡང་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ། །
en: Also now do I correctly understand the knowledge of the origin as related to knowledge of the faculties, and I impart that knowledge to sentient beings.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལ་བརྩོན་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must persevere in gaining knowledge of the origin as related to knowledge of the faculties.

source: མཽད་གལ་གྱི་བུ་ངས་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་རྣམ་པ་དུ་མ་དག་གི་བར་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous roots of virtue in order to understand the knowledge of cessation as related to knowledge of the faculties.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དྲང་སྲོང་ཀུན་འབྱུང་ཞེས་བྱ་བ་ལྔ་མངོན་པར་ཤེས་པ་ཞིག་བྱུང་ངོ་།
en: “Maudgalyāyana, long ago, long before even the distant past, there was a sage named Origin, who possessed the five superknowledges.

source: དེ་ཚལ་གྱི་ནང་ན་དཀའ་ཐུབ་བྱེད་པའི་ཚེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཤེས་པ་གང་གིས་དབང་པོ་འགགས་ཤིང་ཡང་མི་སྐྱེ་བར་འགྱུར་སྙམ་མོ། །
en: While practicing austerities in the forest he thought, ‘Which knowledge will bring cessation of the faculties and prevent their reemergence?

source: འཕགས་པའི་ཤེས་པ་གང་གིས་དབང་པོ་འགག་པ་ཡོངས་སུ་ཤེས་ཏེ།
en: It is through the knowledge of the noble ones that one knows the cessation of the faculties.

source: དབང་པོ་ཤེས་པའི་འགོག་པ་གང་མི་སྐྱེ་བ་དེ།
en: From that cessation of the faculties they do not recur.

source: འདི་ལྟ་སྟེ་དཔེར་ན། མིའི་མགོ་བཅད་པ་ལས་མགོ་ཕྱིར་མི་སྐྱེའོ། །
en: Just as when the head of a human has been cut off and does not grow back,

source: དེ་བཞིན་དུ་དབང་པོ་འགགས་པ་ལས་ཡང་དབང་པོ་མི་སྐྱེ་སྟེ།
en: so no faculties reappear out of the cessation of the faculties.

source: དེ་དབང་པོ་ཤེས་པ་འགོག་པ་ཡིན་ནོ་སྙམ་ནས་
en: Such is cessation as related to knowledge of the faculties.’

source: དེ་ཤེས་པ་དེས་དབང་པོ་ཡོངས་སུ་ཤེས་པར་འདོད་ན་ཤེས་པ་དེ་མ་རྙེད་དོ། །
en: “Yet, although he wished for knowledge of the faculties, he could not achieve it.

source: ཤེས་པ་གང་གིས་དབང་པོ་ཡོངས་སུ་ཤེས་ཤིང་ཡང་མི་སྐྱེ་བའི་ཤེས་པ་དེ་བདག་གིས་ངེས་པར་འཚལ་བར་བྱའོ་སྙམ་ནས།
en: He therefore decided to go searching for that knowledge of the faculties whereby they do not recur.

source: དེ་ཤེས་པ་དེ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དོན་ཉུང་བ། བྱ་བ་ཉུང་བ་དགོན་པ་ན་གནས་པ་གང་དག་མཐོང་བ་དེ་དག་གི་དྲུང་དུ་སོང་ནས་
en: Thus, in pursuit of knowledge, he traveled to meet mendicants and brahmins who had few objectives and few pursuits and who lived in remote areas.

source: དྲིས་པ། གྲོགས་པོ་དག་ཤེས་པ་གང་གིས་དབང་པོ་ཡོངས་སུ་ཤེས་ཤིང་ཡང་སྐྱེ་བར་མི་འགྱུར། དེ་དག་གིས་འདི་སྐད་སྨྲས་སོ། །
en: Of such people he would ask, ‘Friends, which insight brings knowledge of the faculties and the absence of their reemergence?’

source: གྲོགས་པོ་བདག་ཅག་གིས་ཀྱང་ཤེས་པ་གང་གིས་དབང་པོ་ཡོངས་སུ་ཤེས་ཤིང་ཡང་སྐྱེ་བར་མི་འགྱུར་བ་མི་འཚལ་ལོ། །
en: “In reply, people would tell him, ‘Friend, we do not ourselves understand the knowledge of the faculties and the absence of their reemergence.’

source: ཤེས་པ་གང་གིས་དབང་པོ་ཡོངས་སུ་ཤེས་ཤིང་ཡང་མི་སྐྱེ་བར་འགྱུར་བ་བདག་ཉིད་ཀྱིས་ཤེས་པ་བསྐྱེད་པར་བྱའོ་སྙམ་ནས།
en: “The sage then realized that he would have to gain such knowledge of the faculties and the absence of their reemergence himself.

source: ཤེས་པ་དེ་བཙལ་བའི་ཕྱིར། གཏང་བར་དཀའ་བ་དཔག་ཏུ་མེད་པ་དག་ཡོངས་སུ་བཏང་བ་ནས།
en: Hence, in pursuit of such knowledge, he practiced a boundless amount of very demanding generosity.

source: མགོ་ཡོངས་སུ་བཏང་བ་དང་། མིག་གི་བར་ཡོངས་སུ་བཏང་ཡང་དེས་ཤེས་པ་དེ་མ་རྙེད་དོ། །
en: Yet, although he gave away everything, including his own head and eyes, he could not find such knowledge.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ཀུན་འབྱུང་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the sage Origin was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ཀུན་འབྱུང་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the sage Origin.

source: ང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ་དེས་ཤེས་པ་གང་གིས་དབང་པོ་ཡོངས་སུ་ཤེས་ཤིང་ཡང་མི་སྐྱེ་བ་འདི་ལྟ་སྟེ། འཕགས་པའི་ལམ་གྱི་ཤེས་པ་དེ་རྙེད་དོ། །
en: Wishing to awaken to unsurpassed and perfect buddhahood, I achieved knowledge of the path of the noble ones, and thus understood the faculties and the absence of their reemergence.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་གང་གིས་དབང་པོ་འདི་ཡོངས་སུ་ཤེས་ཤིང་ཡང་མི་སྐྱེ་བ་འཕགས་པའི་ཤེས་པ་ཡོངས་སུ་བཙལ་བ་ལ་བརྩོན་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should be diligent in pursuing the knowledge whereby the faculties and the absence of their reemergence is known.

source: མཽད་གལ་གྱི་བུ་ངས་དབང་པོ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཤེས་པ་གང་གིས་དབང་པོ་འགོག་པ་ཡོངས་སུ་ཤེས་ཤིང་ཡང་མི་སྐྱེ་བ་ཤེས་པ་དེ་ཇི་ལྟར་འཐོབ་པར་བྱ་སྙམ་ནས
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, in order to understand the path that leads to cessation as related to knowledge of the faculties, I wondered how I could attain knowledge of the cessation of the faculties and the absence of their reemergence.

source: བཞོན་པའི་གླང་པོ་དཔག་ཏུ་མེད་པ་དག་ཡོངས་སུ་བཏང་། བཞོན་པའི་རྟ་དང་། དེ་བཞིན་དུ་བཞོན་པའི་ཤིང་རྟ་དཔག་ཏུ་མེད་པ་དག་ཡོངས་སུ་བཏང་། རྐང་ཐང་བ་དཔག་ཏུ་མེད་པ་དག་ཡོངས་སུ་བཏང་སྟེ།
en: I therefore gave away innumerable elephant mounts, horses, chariots, and infantrymen.

source: དེས་ན་ངས་ལམ་བར་མའི་ཚོགས་དེ་བྱ་བའི་ཕྱིར་དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དག་བསྐྱེད་དེ།
en: Thus, in order to accomplish the accumulations for the middle path, I produced unfathomable roots of virtue.

source: གལ་ཏེ་དགེ་བའི་རྩ་བ་དེ་གཟུགས་ཅན་དུ་གྱུར་ན་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་ཡང་མི་ཤོང་ངོ་། །
en: If they had form, those roots of virtue could not even be contained within as many universes as there are grains of sand in the river Ganges.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། རྒྱལ་པོ་དགའ་མཐོང་ཞེས་བྱ་བ་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱེད་པ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king by the name of Joyful Sight, who ruled throughout the world of four continents.

source: དེའི་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྒྱས་པར་གྱུར་ཏེ། གླིང་རེ་རེ་ལ་ཡང་གྲོང་ཁྱེར་ས་ཡ་ཕྲག་བརྒྱད་བརྒྱད་བྱུང་ངོ་། །
en: During his reign the world underwent great developments, and so on each continent eight hundred million new cities sprang up.

source: གྲོང་ཁྱེར་རེ་རེ་ཡང་ཆུར་དཔག་ཚད་བཅུ། ཞེང་དུ་དཔག་ཚད་བཅུ་སྟེ། གྲུ་བཞི་ཡིན་ལ་ཤིན་ཏུ་སྤྲུལ་པ།
en: Each of the cities was square, measuring ten leagues on each side.

source: མིག་མངས་རིས་སུ་བྲིས་པ། གསེར་གྱི་སྐུད་པས་གཡོགས་པ།
en: They were of an artful checker design, and the buildings were plated with gold.

source: ར་བ་རིན་པོ་ཆེ་ཐམས་ཅད་ལས་བྱས་པ། ཅོག་འཛམ་བུའི་ཆུ་བོའི་གསེར་ལས་བྱས་པ།
en: The cities were encircled by ramparts of various precious stones, and the fences were made of gold from the Jāmbū River.

source: ནོར་བུ་རིན་ཐང་མེད་པའི་དྲ་བས་སྟེང་ཤིན་ཏུ་གཡོགས་པ། ནོར་བུ་རིན་ཐང་མེད་པ་དག་གིས་ས་གཞི་བཀྲམ་ལ། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བས་ཤིན་ཏུ་གཡོགས་པ།
en: Above hung nets of invaluable jewels, the ground was studded with priceless jewels, and the cities were adorned with nets of small bells that were made of the seven precious substances.

source: སེམས་ཅན་དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་བསགས་པ་རྣམས་ཀྱི་གནས་ཏེ
en: “These cities were the abode of beings who had gathered unfathomable roots of virtue.

source: རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་ལྗོན་པས་ཤིན་ཏུ་གཡོགས་པ། དེའི་ཕྱི་ནང་དུ་ལོངས་སྤྱོད་དང་ལྡན་ཏེ།
en: The cities were beautified by trees of the seven precious substances and full of enjoyments, both outside and within.

source: གང་གི་ཚེ་མི་དག་རྩེ་བར་འདོད་པར་གྱུར་པ་དེ་དག་གང་འདོད་པ། སིལ་སྙན་ཡན་ལག་ལྔ་པས་ཡོངས་སུ་སྤྱོད་དེ། དེའི་ཚེ་སིལ་སྙན་ཡན་ལག་ལྔ་པའི་སྒྲ་རབ་ཏུ་འབྱུང་ངོ་། །
en: Whenever the inhabitants wished to play, they would do so accompanied by the natural sound of the five types of instruments.

source: གང་གི་ཚེ་པི་ཝང་དང་། སིལ་སྙན་དག་གིས་ཡོངས་སུ་སྤྱོད་པར་འོས་པ་དེའི་ཚེ་པི་ཝང་དང་། སིལ་སྙན་དག་གི་སྒྲ་རབ་ཏུ་འབྱུང་ངོ་། །
en: Likewise, whenever the music of sitars, flutes, and cymbals would be appropriate, such music would come about naturally.

source: གང་གི་ཚེ་དྲི་ཟའི་རོལ་མོས་ཡོངས་སུ་སྤྱོད་པར་འདོད་པ་དེའི་ཚེ་དྲི་ཟའི་རོལ་མོ་བྱེད་དོ། །
en: Whenever people wished to enjoy the music of gandharvas, such music could be heard.

source: རྒྱ་ཆེར་གང་དང་གང་ཉིད་རྩེ་བར་འདོད་པའི་རྩེད་མོ་དེ་དང་དེ་ཉིད་བྱུང་ངོ་། །
en: Whatever the people wished to enjoy, such entertainment would indeed manifest, and remain for as long as they desired.

source: ལོར་རམ། ལོ་སྟོང་དུ་འམ། ལོ་ཁྲིར་རྩེ་བར་འདོད་ན་དེ་ཉིད་ཀྱིས་རྩེ་བར་བྱེད་དེ། དེ་རྟག་པར་རྒྱུན་ཏུ་རྩེ་བའི་རྗེས་སུ་འཇུག་གོ། །
en: Whether for one year, a thousand years, or ten thousand years, people could frolic for as long as they wished.

source: གྲོང་ཁྱེར་དེའི་འབྱོར་པ་དང་ལྡན་པ་ནི་དེ་འདྲ་སྟེ། དེ་ལྟར་གྲོང་ཁྱེར་ཐམས་ཅད་དུ་རྩེད་མོ་དེ་དག་དང་ལྡན་པར་གྱུར་ཏོ། །
en: Such were the riches of those cities, each one of them a center of entertainment.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་འོད་ཟེར་ཞེས་བྱ་བ་བྱུང་སྟེ། དེའི་འཁོར་ཉན་ཐོས་འབུམ་ཕྲག་བརྒྱད་བྱུང་ངོ་། །
en: “At that time there had appeared a thus-gone one known as Amṛtaprabha, whose retinue included eight hundred thousand hearers.

source: དེ་ནས་རྒྱལ་པོ་དགའ་མཐོང་གིས་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་དར་གྱི་ལྡ་ལྡི་བཏགས་ཤིང་ཡུལ་ཐམས་ཅད་ཤིན་ཏུ་བརྒྱན་ཏེ། སྔོན་གྱི་མི་དང་བཅས་པར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་འོད་ཟེར་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་དེའི་ཡོངས་སུ་སྤྱོད་པའི་དོན་དུ་ཕུལ་ལོ། །
en: King Joyful Sight adorned his entire world of four continents with silk tassels and ornaments, and so he offered it, along with the people of that time, for the use of the blessed thus-gone Amṛtaprabha and his saṅgha of hearers.

source: བདག་གི་བུ་དང་ཆུང་མ་དང་འཁོར་ཀྱང་ཕུལ་ལོ། །
en: The king also offered his children, spouse, and retinue.

source: དེར་བཅོམ་ལྡན་འདས་དེ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ཉན་ཐོས་འབུམ་ཕྲག་བརྒྱད་དང་། ཐབས་ཅིག་ཏུ་སངས་རྒྱས་ཀྱི་བཞུགས་པ་དཔག་ཏུ་མེད་པས་བཞུགས་སོ། །
en: Thus that blessed one and his saṅgha of eight hundred thousand hearers took up residence in innumerable dwellings,

source: དེ་ལ་ཡང་རྒྱལ་པོ་དགའ་མཐོང་གིས་ལོ་ས་ཡ་ཕྲག་བརྒྱད་དུ་ཞལ་ཟས་རོ་བརྒྱ་པས་ཡོངས་སུ་མཉེས་པར་བྱས་སོ། །
en: and for eight million years King Joyful Sight offered them the most delicious meals.

source: བཙུན་མོ་དང་འཁོར་དང་བཅས་པས་ཀྱང་ཡོངས་སུ་སྤྱད་པ་བྱས་སོ། །
en: His queen and retinue also made similar offerings.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དགའ་མཐོང་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time King Joyful Sight was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དགའ་མཐོང་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the king Joyful Sight.

source: མཽད་གལ་གྱི་བུ་རྒྱ་ཆེར་བྱ་སྟེ། དགེ་བའི་རྩ་བ་དེས་ང་དབང་པོ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་བརྙེས་སོ། །
en: Maudgalyāyana, by those roots of virtue I gained knowledge of the path that leads to cessation as related to knowledge of the faculties.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་དད་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must have faith in the buddhas and in the saṅgha of monks.

source: དད་པ་ཐོབ་པ་ནི་བསྐལ་པ་གྲངས་མེད་དཔག་ཏུ་མེད་པར་བདེ་བའི་ཡོ་བྱད་འགྲུབ་པར་འགྱུར། བྱང་ཆུབ་ཀྱང་འགྲུབ་པར་འགྱུར་རོ། །
en: Having attained faith, one will gain pleasurable enjoyments throughout innumerable and boundless eons, and also accomplish awakening.”

source: མཽད་གལ་གྱི་བུ་ངས་སྟོབས་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། སེམས་ཅན་ཐམས་ཅད་དབང་པོ་རྣམས་ཀྱི་སྟོབས་དང་། སྟོབས་མ་ཡིན་པ་ཇི་ལྟར་ཤེས་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the powers. I did this by wondering how I could understand sentient beings’ faculties in the form of both powers and non-powers.
